ZhikaiZhang1/REDPINE_REAL/REDPINE/GARMIN_SDK_v2.0.1/RSI_SDK_v1.0/platforms/NXP_FRDM_K28/board/pin_mux.c
    /* PORTA25 (pin J11) is configured as SDHC0_D0 */
    PORT_SetPinMux(PORTA, 25U, kPORT_MuxAlt4);

    PORTA->PCR[25] = ((PORTA->PCR[25] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTA26 (pin J10) is configured as SDHC0_DCLK */
    PORT_SetPinMux(PORTA, 26U, kPORT_MuxAlt4);

    PORTA->PCR[26] = ((PORTA->PCR[26] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTA27 (pin H13) is configured as SDHC0_CMD */
    PORT_SetPinMux(PORTA, 27U, kPORT_MuxAlt4);

    PORTA->PCR[27] = ((PORTA->PCR[27] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTA28 (pin H12) is configured as SDHC0_D3 */
    PORT_SetPinMux(PORTA, 28U, kPORT_MuxAlt4);

    PORTA->PCR[28] = ((PORTA->PCR[28] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTA29 (pin H11) is configured as SDHC0_D2 */
    PORT_SetPinMux(PORTA, 29U, kPORT_MuxAlt4);

    PORTA->PCR[29] = ((PORTA->PCR[29] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTA8 (pin K9) is configured as PTA8 */
    PORT_SetPinMux(BOARD_INITPINS_RESET_PORT, BOARD_INITPINS_RESET_PIN, kPORT_MuxAsGpio);

    /* PORTA9 (pin K10) is configured as PTA9 */
    PORT_SetPinMux(BOARD_INITPINS_INTERRUPT_PORT, BOARD_INITPINS_INTERRUPT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA9 (pin K10): Interrupt when logic one */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_INTERRUPT_PORT, BOARD_INITPINS_INTERRUPT_PIN, kPORT_InterruptLogicOne);

    /* PORTB5 (pin F13) is configured as PTB5 */
    PORT_SetPinMux(PORTB, 5U, kPORT_MuxAsGpio);

    PORTB->PCR[5] = ((PORTB->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTC24 (pin B7) is configured as LPUART0_TX */
    PORT_SetPinMux(PORTC, 24U, kPORT_MuxAlt3);

    /* PORTC25 (pin A7) is configured as LPUART0_RX */
    PORT_SetPinMux(PORTC, 25U, kPORT_MuxAlt3);

    /* PORTD11 (pin C2) is configured as SPI2_PCS0 */
    PORT_SetPinMux(PORTD, 11U, kPORT_MuxAlt2);

    /* PORTD12 (pin B2) is configured as SPI2_SCK */
    PORT_SetPinMux(PORTD, 12U, kPORT_MuxAlt2);

    /* PORTD13 (pin B3) is configured as SPI2_SOUT */
    PORT_SetPinMux(PORTD, 13U, kPORT_MuxAlt2);

    /* PORTD14 (pin A2) is configured as SPI2_SIN */
    PORT_SetPinMux(PORTD, 14U, kPORT_MuxAlt2);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_LPUART0TXSRC_MASK | SIM_SOPT5_LPUART0RXSRC_MASK)))

                  /* LPUART0 transmit data source select: LPUART0_TX pin. */
                  | SIM_SOPT5_LPUART0TXSRC(SOPT5_LPUART0TXSRC_LPUART_TX)

                  /* LPUART0 receive data source select: LPUART0_RX pin. */
                  | SIM_SOPT5_LPUART0RXSRC(SOPT5_LPUART0RXSRC_LPUART_RX));
}
#else
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

//! Adding 2 GPIO pins for Power save
    //! MCU-PIN2 - freedom-PIND10->output PIN
    //! MCU-PIN3 - freedom-PIND15->Input PIN
    /*
    -------------------------------------
	|MCU PIN|freedom board PIN |Direction|
	--------------------------------------
	|   2   |      PIND10      |  Output |
	|   3   |      PIND15      |  Input  |
	--------------------------------------
	*/

	gpio_pin_config_t PS_out_config = {
			.pinDirection = kGPIO_DigitalOutput,
			.outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA8 (pin K9)  */
    GPIO_PinInit(BOARD_INITPINS_PS_OUT_GPIO, BOARD_INITPINS_PS_OUT_PIN , &PS_out_config);

    /* PORTA8 (pin K9) is configured as PTA8 */
    PORT_SetPinMux(BOARD_INITPINS_PS_OUT_PORT, BOARD_INITPINS_PS_OUT_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[10] = ((PORTD->PCR[10] &
    		/* Mask bits to zero which are setting */
    		(~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

    		/* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
    		 * corresponding PE field is set. */
    		| (uint32_t)(kPORT_PullDown));


    gpio_pin_config_t PS_in_config = {

    		.pinDirection = kGPIO_DigitalInput,
			.outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA8 (pin K9)  */
    GPIO_PinInit(BOARD_INITPINS_PS_IN_GPIO, BOARD_INITPINS_PS_IN_PIN , &PS_in_config);

