ZhikaiZhang1/REDPINE_REAL/REDPINE/GARMIN_SDK_v2.0.1/RSI_SDK_v1.0/platforms/NXP_FRDM_K28/board/pin_mux.c
    /* PORTA8 (pin K9) is configured as PTA8 */
    PORT_SetPinMux(BOARD_INITPINS_PS_IN_PORT, BOARD_INITPINS_PS_IN_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[15] = ((PORTD->PCR[15] &
    		/* Mask bits to zero which are setting */
    		(~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

    		/* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
    		 * corresponding PE field is set. */
    		| (uint32_t)(kPORT_PullDown));
			
    gpio_pin_config_t RESET_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };

    /* Initialize GPIO functionality on pin PTD14  */
    GPIO_PinInit(BOARD_INITPINS_RESET_GPIO, BOARD_INITPINS_RESET_PIN, &RESET_config);

    /* PORTD14 is configured as PTD14 */
    PORT_SetPinMux(BOARD_INITPINS_RESET_PORT, BOARD_INITPINS_RESET_PIN, kPORT_MuxAsGpio);

    gpio_pin_config_t INTERRUPT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };


    /* Interrupt configuration on PORTD9 (pin K10): Interrupt when logic one */
#if WIFI_TCP_BI_DIR
    PORT_SetPinInterruptConfig(BOARD_INITPINS_INTERRUPT_PORT, BOARD_INITPINS_INTERRUPT_PIN, kPORT_InterruptLogicOne);
#else
    PORT_SetPinInterruptConfig(BOARD_INITPINS_INTERRUPT_PORT, BOARD_INITPINS_INTERRUPT_PIN, kPORT_InterruptRisingEdge);
#endif


    /* Initialize GPIO functionality on pin PTA9 (pin K10)  */
     GPIO_PinInit(BOARD_INITPINS_INTERRUPT_GPIO, BOARD_INITPINS_INTERRUPT_PIN, &INTERRUPT_config);

#if 1
    PORTD->PCR[9] = ((PORTD->PCR[9] &
                           /* Mask bits to zero which are setting */
                           (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                          /* Pull Select: Internal pullup resistor is disabled on the corresponding pin, if the
                           * corresponding PE field is clear. */
                          | (uint32_t)(kPORT_PullDown));
#endif

    /* PORTA9 (pin K10) is configured as PTA9 */
    PORT_SetPinMux(BOARD_INITPINS_INTERRUPT_PORT, BOARD_INITPINS_INTERRUPT_PIN, kPORT_MuxAsGpio);

    /* PORTA14 (pin K13) is configured as SPI0_PCS0 */
    PORT_SetPinMux(PORTA, 14U, kPORT_MuxAlt2);

    /* PORTA15 (pin K12) is configured as SPI0_SCK */
    PORT_SetPinMux(PORTA, 15U, kPORT_MuxAlt2);

    /* PORTA16 (pin J13) is configured as SPI0_SOUT */
    PORT_SetPinMux(PORTA, 16U, kPORT_MuxAlt2);

    /* PORTA17 (pin J12) is configured as SPI0_SIN */
    PORT_SetPinMux(PORTA, 17U, kPORT_MuxAlt2);

    /* PORTA24 (pin K11) is configured as SDHC0_D1 */
    PORT_SetPinMux(PORTA, 24U, kPORT_MuxAlt4);

    PORTA->PCR[24] = ((PORTA->PCR[24] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTA25 (pin J11) is configured as SDHC0_D0 */
    PORT_SetPinMux(PORTA, 25U, kPORT_MuxAlt4);

    PORTA->PCR[25] = ((PORTA->PCR[25] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTA26 (pin J10) is configured as SDHC0_DCLK */
    PORT_SetPinMux(PORTA, 26U, kPORT_MuxAlt4);

    PORTA->PCR[26] = ((PORTA->PCR[26] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTA27 (pin H13) is configured as SDHC0_CMD */
    PORT_SetPinMux(PORTA, 27U, kPORT_MuxAlt4);

    PORTA->PCR[27] = ((PORTA->PCR[27] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTA28 (pin H12) is configured as SDHC0_D3 */
    PORT_SetPinMux(PORTA, 28U, kPORT_MuxAlt4);

    PORTA->PCR[28] = ((PORTA->PCR[28] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTA29 (pin H11) is configured as SDHC0_D2 */
    PORT_SetPinMux(PORTA, 29U, kPORT_MuxAlt4);

    PORTA->PCR[29] = ((PORTA->PCR[29] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));


    /* PORTB5 (pin F13) is configured as PTB5 */
    PORT_SetPinMux(PORTB, 5U, kPORT_MuxAsGpio);

    PORTB->PCR[5] = ((PORTB->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTC24 (pin B7) is configured as LPUART0_TX */
    PORT_SetPinMux(PORTC, 24U, kPORT_MuxAlt3);

