ZhikaiZhang1/REDPINE_REAL/REDPINE/GARMIN_SDK_v2.0.1/RSI_SDK_v1.0/platforms/NXP_FRDM_K28/board/pin_mux.c
    /* PORTC25 (pin A7) is configured as LPUART0_RX */
    PORT_SetPinMux(PORTC, 25U, kPORT_MuxAlt3);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_LPUART0TXSRC_MASK | SIM_SOPT5_LPUART0RXSRC_MASK)))

                  /* LPUART0 transmit data source select: LPUART0_TX pin. */
                  | SIM_SOPT5_LPUART0TXSRC(SOPT5_LPUART0TXSRC_LPUART_TX)

                  /* LPUART0 receive data source select: LPUART0_RX pin. */
                  | SIM_SOPT5_LPUART0RXSRC(SOPT5_LPUART0RXSRC_LPUART_RX));

    //! SDRAM pins
    /* PORTB0 (pin G13) is configured as SDRAM_CAS_b */
        PORT_SetPinMux(PORTB, 0U, kPORT_MuxAlt5);

        /* PORTB1 (pin G12) is configured as SDRAM_RAS_b */
        PORT_SetPinMux(PORTB, 1U, kPORT_MuxAlt5);

        /* PORTB10 (pin G9) is configured as SDRAM_D19 */
        PORT_SetPinMux(PORTB, 10U, kPORT_MuxAlt5);

        /* PORTB11 (pin E13) is configured as SDRAM_D18 */
        PORT_SetPinMux(PORTB, 11U, kPORT_MuxAlt5);

        /* PORTB16 (pin F8) is configured as SDRAM_D17 */
        PORT_SetPinMux(PORTB, 16U, kPORT_MuxAlt5);

        /* PORTB17 (pin D13) is configured as SDRAM_D16 */
        PORT_SetPinMux(PORTB, 17U, kPORT_MuxAlt5);

        /* PORTB18 (pin D12) is configured as SDRAM_A23 */
        PORT_SetPinMux(PORTB, 18U, kPORT_MuxAlt5);

        /* PORTB2 (pin G11) is configured as SDRAM_WE_b */
        PORT_SetPinMux(PORTB, 2U, kPORT_MuxAlt5);

        /* PORTB20 (pin D10) is configured as SDRAM_D31 */
        PORT_SetPinMux(PORTB, 20U, kPORT_MuxAlt5);

        /* PORTB21 (pin D9) is configured as SDRAM_D30 */
        PORT_SetPinMux(PORTB, 21U, kPORT_MuxAlt5);

        /* PORTB22 (pin C13) is configured as SDRAM_D29 */
        PORT_SetPinMux(PORTB, 22U, kPORT_MuxAlt5);

        /* PORTB23 (pin C12) is configured as SDRAM_D28 */
        PORT_SetPinMux(PORTB, 23U, kPORT_MuxAlt5);

        /* PORTB3 (pin G10) is configured as SDRAM_CS0_b */
        PORT_SetPinMux(PORTB, 3U, kPORT_MuxAlt5);

        /* PORTB6 (pin F12) is configured as SDRAM_D23 */
        PORT_SetPinMux(PORTB, 6U, kPORT_MuxAlt5);

        /* PORTB7 (pin F11) is configured as SDRAM_D22 */
        PORT_SetPinMux(PORTB, 7U, kPORT_MuxAlt5);

        /* PORTB8 (pin F10) is configured as SDRAM_D21 */
        PORT_SetPinMux(PORTB, 8U, kPORT_MuxAlt5);

        /* PORTB9 (pin F9) is configured as SDRAM_D20 */
        PORT_SetPinMux(PORTB, 9U, kPORT_MuxAlt5);

        /* PORTC0 (pin B13) is configured as SDRAM_A22 */
        PORT_SetPinMux(PORTC, 0U, kPORT_MuxAlt5);

        /* PORTC1 (pin B12) is configured as SDRAM_A21 */
        PORT_SetPinMux(PORTC, 1U, kPORT_MuxAlt5);

        /* PORTC10 (pin A8) is configured as SDRAM_A13 */
        PORT_SetPinMux(PORTC, 10U, kPORT_MuxAlt5);

        /* PORTC12 (pin B9) is configured as SDRAM_D27 */
        PORT_SetPinMux(PORTC, 12U, kPORT_MuxAlt5);

        /* PORTC13 (pin B8) is configured as SDRAM_D26 */
        PORT_SetPinMux(PORTC, 13U, kPORT_MuxAlt5);

        /* PORTC14 (pin C8) is configured as SDRAM_D25 */
        PORT_SetPinMux(PORTC, 14U, kPORT_MuxAlt5);

        /* PORTC15 (pin D8) is configured as SDRAM_D24 */
        PORT_SetPinMux(PORTC, 15U, kPORT_MuxAlt5);

        /* PORTC16 (pin E8) is configured as SDRAM_DQM2 */
        PORT_SetPinMux(PORTC, 16U, kPORT_MuxAlt5);

        /* PORTC17 (pin E7) is configured as SDRAM_DQM3 */
        PORT_SetPinMux(PORTC, 17U, kPORT_MuxAlt5);

        /* PORTC2 (pin A13) is configured as SDRAM_A20 */
        PORT_SetPinMux(PORTC, 2U, kPORT_MuxAlt5);

        /* PORTC3 (pin A12) is configured as CLKOUT */
        PORT_SetPinMux(PORTC, 3U, kPORT_MuxAlt5);

        /* PORTC4 (pin B11) is configured as SDRAM_A19 */
        PORT_SetPinMux(PORTC, 4U, kPORT_MuxAlt5);

        /* PORTC5 (pin A11) is configured as SDRAM_A18 */
        PORT_SetPinMux(PORTC, 5U, kPORT_MuxAlt5);

        /* PORTC7 (pin B10) is configured as SDRAM_A16 */
        PORT_SetPinMux(PORTC, 7U, kPORT_MuxAlt5);

        /* PORTC8 (pin C10) is configured as SDRAM_A15 */
        PORT_SetPinMux(PORTC, 8U, kPORT_MuxAlt5);

        /* PORTC9 (pin C9) is configured as SDRAM_A14 */
        PORT_SetPinMux(PORTC, 9U, kPORT_MuxAlt5);

        /* PORTD2 (pin A4) is configured as SDRAM_A12 */
        PORT_SetPinMux(PORTD, 2U, kPORT_MuxAlt5);

        /* PORTD3 (pin B4) is configured as SDRAM_A11 */
        PORT_SetPinMux(PORTD, 3U, kPORT_MuxAlt5);

        /* PORTD4 (pin B5) is configured as SDRAM_A10 */
        PORT_SetPinMux(PORTD, 4U, kPORT_MuxAlt5);

        /* PORTD5 (pin C4) is configured as SDRAM_A9 */
        PORT_SetPinMux(PORTD, 5U, kPORT_MuxAlt5);

        /* PORTD7 (pin E5) is configured as SDRAM_CKE */
        PORT_SetPinMux(PORTD, 7U, kPORT_MuxAlt5);
}
#endif
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
